Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_DevelopiOSAppsSwift/DevelopiOSAppsSwift-level2.tmx
Source language: en_us
Languages: ja

source: Specifically, when a user enters a meal name, rating, and photo in the meal detail scene and taps the Save button, you want MealViewController to configure a Meal object with the appropriate information and pass it back to MealTableViewController to display in the meal list.
ja: 具体的には、ユーザが食事名、格付け、そして写真を食事詳細シーンにおいて入力してSaveボタンをタップする時、あなたはMealViewControllerがひとつのMealオブジェクトを適切な情報とともに構成して、それをMealTableViewControllerに戻して渡して食事リストにおいて表示することを望みます。

source: Specifically, when an instance of MealViewController (the meal detail scene) gets created, its views should be populated with data from its meal property, if that data exists.
ja: 具体的には、MealViewControllerのインスタンス（食事詳細シーン）が作成されるとき、それのビューは、それのmealプロパティからのデータで満たされるべきです、そのデータが存在するならば。

source: Specifying the type of this action method to be UIButton means that only button objects can connect to this action.
ja: このアクションメソッドの型をUIButtonに指定することは、ボタンオブジェクトだけがこのアクションに接続できるのを意味します。

source: Start by adding a Meal property to MealViewController.
ja: MealプロパティをMealViewControllerに加えることで始めます。

source: Start by adding a text field (UITextField), one such subclass of UIView, to your scene.
ja: そのようなUIViewのサブクラスの１つ、テキスト欄（UITextField）をあなたのシーンに加えることで始めましょう。

source: Start by creating a simple action that sets the label to Default Text whenever the user taps the Set Default Text button.
ja: 簡単なアクションを作成することで始めましょう、それはユーザがSet Default TextボタンをタップするたびごとにラベルをDefault Textに設定します。

source: Start by setting up the segues between meal list items and the meal detail scene.
ja: 食事リスト項目と食事詳細シーンの間のセグエを準備することで始めてください。

source: Start with something simple, like getting a single red button to show up in your view.
ja: 始めに簡単なことをします、例えばひとつだけ赤いボタンをあなたのビューに表示させることのような。

source: Starting with a zero-sized button is fine, because you’re using Auto Layout.
ja: 大きさゼロのボタンで始めることは非常に良いことです、なぜならあなたは「自動レイアウト」を使うからです。

source: Still, the user can modify the data while the app is running.
ja: それでも、ユーザはアプリが実行している間にデータを修正できます。

source: Stop dragging the button when you see something like this:
ja: ボタンのドラッグをやめた時あなたが見るのはこのようなものです：

source: Stop dragging the label when you see something like this:
ja: ラベルのドラッグをやめた時あなたが見るのはこのようなものです：

source: Stop dragging the text field when you see something like this:
ja: テキスト欄のドラッグをやめた時あなたが見るものはこのようなものです：

source: Store New Meals in the Meal List
ja: 新しい食事を食事リストに格納する

source: Support Deleting Meals
ja: 食事の削除のサポート

source: Swift handles initializers differently than other methods.
ja: Swiftは、イニシャライザを他のメソッドとは異なって扱います。

source: Swift standard library
ja: Swift標準ライブラリ

source: Table view cells come with a variety of predefined behavior and default cell styles; however, because you have more content to display in each cell than the default styles allow, you’ll need to define a custom cell style.
ja: テーブルビューセルは、さまざまな前もって定義された挙動と省略時のセルスタイルを備えます；しかしながら、あなたは省略時のスタイルよりももっと多くのコンテンツを各セルに表示しなければならないことから、あなたはカスタムセルスタイルを定義する必要があります。

source: Take a few moments to familiarize yourself with the main sections of the Xcode workspace.
ja: 少しだけ時間をとってXcodeワークスペースのさまざまな主要部門に慣れておいてください。

source: Take a minute to understand what’s happening in this line of code.
ja: 少し時間をとってコードのこの行で何が起こっているか理解しましょう。

source: Take a moment to understand the code in the file so far.
ja: ちょっと時間をとって、このファイルのコードのある程度理解しましょう。

source: Tap on a meal from the meal list.
ja: 食事リストからある食事をタップしてください。

source: Tapping any of the buttons at this point should still call ratingButtonTapped(_:) and log the message to the console.
ja: ボタンのどれかをタップすると、この時点ではまだratingButtonTapped(_:)を呼び出してメッセージをコンソールに記録するはずです。

source: Target-action is a design pattern where one object sends a message to another object when a specific event occurs.
ja: 「ターゲットアクション」は、ひとつデザインパターンで、そこにおいては一方のオブジェクトはあるメッセージを別のオブジェクトへと特定のイベントが起こる時に送り出します。

source: Team: If this is not automatically filled in, set the team to None.
ja: チーム：これが自動的に記入されないならば、チームはNoneに設定してください。

source: Test Your Data
ja: あなたのデータをテストする

source: Test a data model by writing and running unit tests
ja: ユニットテストを書いて実行することでデータモデルをテストする

source: Test cases are simply methods that the system automatically runs as part of your unit tests.
ja: テスト事例は、単純なメソッドで、システムは自動的にあなたのユニットテストの一部として実行します。

source: That is, the flow of the app is determined by events: system events and user actions.
ja: すなわち、アプリの動作の流れを決定するのはイベント：システムイベントおよびユーザアクションです。

source: That means that the number of rows should be the number of Meal objects in your meals array.
ja: それが意味するのは、列の数はあなたのmeals配列の中のMealオブジェクトの数であるはずだということです。

source: That way you won’t accidentally forget to disable them when it actually matters.
ja: そのようにしてあなたはそれが実際に重要である時それらを作動しないようにするのを誤って忘れないでしょう。

source: That way you won’t forget it when you subclass a different class.
ja: そのようにしてあなたは、あなたが異なるクラスをサブクラスにする時、それを忘れないようにします。

source: That’s all you need to delete for now.
ja: これが今のところあなたが削除に必要なすべてです。

source: That’s all you need to do to see the result.
ja: これがあなたが結果を見るために必要なすべてです。

source: That’s where actions come in.
ja: そこでアクションの出番です。

source: The #selector expression returns the Selector value for the provided method.
ja: #selector式は、与えられたメソッドに対するSelector値を返します。

source: The .automatic animation option uses the best animation based on the table’s current state, and the insertion point’s location.
ja: .automaticアニメーションオプションは、テーブルの持つ現在の状態、そして挿入点の位置に基づいて最良のアニメーションを使用します。

source: The .photoLibrary option uses the simulator’s camera roll.
ja: .PhotoLibraryオプションは、シミュレータのカメラロールを使います。

source: The AppDelegate.swift source file has two primary functions:
ja: AppDelegate.swiftソースファイルは、２つの主要な機能を持ちます：

source: The AppDelegate class also contains stub implementations of the following delegate methods:
ja: AppDelegateクラスはまた、以下のデリゲートメソッドのスタブ実装を含みます：

source: The AppDelegate class contains a single property: window.
ja: AppDelegateクラスは、ただ１つのプロパティ（特性）：windowだけを含みます。

source: The AppDelegate class is automatically created whenever you create a new project.
ja: AppDelegateクラスは、あなたが新しいプロジェクトを作成するたびごとに自動的に作成されます。

source: The DocumentsDirectory constant uses the file manager’s urls(for:in:) method to look up the URL for your app’s documents directory.
ja: DocumentsDirectory定数は、ファイルマネージャの持つurls(for:in:)メソッドを使って、あなたのアプリの書類ディレクトリに対するURLを検索します。

source: The IBOutlet attribute tells Xcode that you can connect to the nameTextField property from Interface Builder (which is why the attribute has the IB prefix).
ja: IBOutlet属性がXcodeに教えるのは、あなたがnameTextFieldプロパティにインターフェイスビルダーから接続できるということです（それはその属性がIB接頭辞を持つことが理由です）。

source: The Meal class’s init?(name:, photo:, rating:) initializer is a failable initializer.
ja: Mealクラスの持つinit?(name:, photo:, rating:)イニシャライザは失敗できるイニシャライザです。

source: The NSCoding protocol declares two methods that any class that adopts to it must implement so that instances of that class can be encoded and decoded:
ja: NSCodingプロトコルは、２つのメソッドを宣言します、それは、それを採用するあらゆるクラスが実装しなければならないもので、それによってそのクラスのインスタンスが符号化と複合化ができるものです：

source: The UIControlEvents option set defines a number of events that controls can respond to.
ja: UIControlEventsオプションセットは、コントロールが応答することができる多くのイベントを定義します。

source: The UITextFieldDelegate protocol defines eight optional methods.
ja: UITextFieldDelegateプロトコルは、８つのオプショナルメソッドを定義します。

source: The UIViewController class’s implementation doesn’t do anything, but it’s a good habit to always call super.prepare(for:sender:) whenever you override prepare(for:sender:).
ja: UIViewControllerクラスの持つ実装は何もしません、しかしそれはあなたがprepare(for:sender:)をオーバーライドするときはいつでも常にsuper.prepare(for:sender:)を呼び出すための良い習慣です。

source: The ViewController class now has a reference to the rating control in the storyboard.
ja: ViewControllerクラスは今ではストーリーボードの中の格付けコントロールに対する参照を持ちます。

source: The addArrangedSubview() method adds the button you created to the list of views managed by the RatingControl stack view.
ja: addArrangedSubview()メソッドは、あなたが作成したボタンをRatingControlスタックビューによって管理されるビューのリストに加えます。

source: The addTarget(_, action:, for:) method does the same thing in code.
ja: addTarget(_, action:, for:)メソッドは、同じことをコードの中で行います。

source: The as? MealTableViewCell expression attempts to downcast the returned object from the UITableViewCell class to your MealTableViewCell class.
ja: as? MealTableViewCell式は、UITableViewCellクラスから返されたオブジェクトをあなたのMealTableViewCellクラスへとダウキャストを試みます。

source: The convenience modifier means that this is a secondary initializer, and that it must call a designated initializer from the same class.
ja: convenience修飾子は、これが補助のイニシャライザであること、そしてそれは指定イニシャライザを同じクラスから呼び出さなければならないことを意味します。

source: The decodeIntegerForKey(_:) method unarchives an integer.
ja: decodeIntegerForKey(_:)メソッドは、整数をアンアーカイブします。

source: The decodeObject(forKey:) method decodes encoded information.
ja: decodeObject(forKey:)メソッドは、エンコードされた情報をデコードします。

source: The dequeueReusableCell(withIdentifier:for:) method requests a cell from the table view.
ja: dequeueReusableCell(withIdentifier:for:)メソッドは、テーブルビューから１つのセルを要求します。

source: The dismiss(animated:completion:) method dismisses the modal scene and animates the transition back to the previous scene (in this case, the meal list).
ja: dismiss(animated:completion:)メソッドはモーダルシーンを退去させて、以前のシーン（この場合には、食事リスト）に戻る推移をアニメーションにします。

source: The else block is called if the user is editing an existing meal.
ja: elseブロックは、ユーザが既存の食事を編集しているならば呼び出されます。

source: The else clause executes when there’s no selected row in the table view, which means a user tapped the Add button to get to the meal detail scene.
ja: else節は、テーブルピューの中に選択された行がない場合に実行されます、そしてそれはユーザがAddボタンをタップして食事詳細シーンに行ったことを意味します。

source: The encode(with:) method prepares the class’s information to be archived, and the initializer unarchives the data when the class is created.
ja: encode(with:)メソッドはクラスの情報をアーカイブされるように準備します、そしてイニシャライザはクラスが作成される時にデータをアンアーカイブします。

source: The encode(with:) method should look like this:
ja: encode(with:)メソッドは、このように見えるはずです：

source: The guard let expression safely unwraps the optional.
ja: guard let式は、安全にそのオプショナルをアンラップします。

source: The info dictionary always contains the original image that was selected in the picker.
ja: infoディクショナリは、常にピッカーにおいて選択されたオリジナル画像を含みます。

source: The required modifier means this initializer must be implemented on every subclass, if the subclass defines its own initializers.
ja: required修飾子は、このイニシャライザがすべてのサブクラス上で実装されなければならないことを意味します、もしサブクラスがそれ独自のイニシャライザを定義している場合は。

source: The self refers to the ViewController class, because it’s referenced inside the scope of the ViewController class definition.
ja: このselfはViewControllerクラスを参照します、なぜならそれがViewControllerクラス定義のスコープないが参照されるからです。

source: The sender parameter refers to the object that was responsible for triggering the action—in this case, a button.
ja: senderパラメーターは、このアクションを引き起こす原因となったオブジェクトを参照します—この場合、ボタンです。

source: The setupButtons() method should now appear as shown below:
ja: setupButtons()メソッドは、今では下で示すように現れます：

source: The setupButtons() method should now look like this:
ja: setupButtons()メソッドは今ではこのように見えるはずです：

source: The textFieldDidBeginEditing method gets called when an editing session begins, or when the keyboard gets displayed.
ja: textFieldDidBeginEditingメソッドは、編集期間が始まる時、またはキーボードが表示される時に呼ばれます。

source: The textFieldDidEndEditing(_:) method gives you a chance to read the information entered into the text field and do something with it.
ja: textFieldDidEndEditing(_:)メソッドがあなたに与えるのは、テキスト欄に入力された情報を読んでそれで何かをする機会です。

source: The AppDelegate class adopts the UIApplicationDelegate protocol.
ja: AppDelegateクラスは、UIApplicationDelegateプロトコルを採用します。

source: The IBAction attribute indicates that the method is an action that you can connect to from your storyboard in Interface Builder.
ja: IBAction属性が示すのは、このメソッドは、インターフェイスビルダーの中のあなたのストーリーボードからどこかへあなたが接続できるアクションだということです。

source: The else statement uses an if let statement to safely unwrap the view controller’s navigationController property.
ja: else文は、if let文を使って、安全にビューコントローラの持つnavigationControllerプロパティをアンラップします。

source: The static keyword indicates that these constants belong to the structure itself, not to instances of the structure.
ja: staticキーワードが示すのは、これらの定数が構造体それ自体に属しているということです、構造体のインスタンスにではなく。

source: The testMealInitializationSucceeds() test case should succeed, while the testMealInitializationFails() test case fails.
ja: testMealInitializationSucceeds()テスト項目はうまくいくはずです、一方testMealInitializationFails()テスト項目は失敗します。

source: The Meal class is a perfect candidate for unit testing.
ja: Mealクラスは、ユニットテストの完璧な有資格者です。

source: The fatalError() method logs an error message to the console, including the contents of the info dictionary, and then causes the app to terminate—preventing it from continuing in an invalid state.
ja: fatalError()メソッドは、infoディクショナリの内容を含めて、エラーメッセージをコンソールに記録して、それからアプリの終了を引き起こします — それが不正な状態で続けるのを妨げます。

source: The setupButtons() method should now look as shown below:
ja: setupButtons()メソッドは、今では下に示すように見えるはずです：

source: The weak keyword indicates that the reference does not prevent the system from deallocating the referenced object.
ja: weakキーワードは、参照されたオブジェクトをシステムがディアロケートするのを、その参照は妨げないということを指し示します。

source: The meal property will only be non-nil when an existing meal is being edited.
ja: mealプロパティは、既存の食事を編集している場合にのみ非nilです。

source: The completion parameter refers to a completion handler, a piece of code that executes after this method completes.
ja: completionパラメータは、完了ハンドラを参照します、それはこのメソッドが完了した後に実行されるコード片です。

source: The Attributes inspector appears when you click the fourth button from the left in the inspector selector bar.
ja: Attributesインスペクタは、あなたがインスペクタバーの左から４番目のボタンをクリックすると現れます。

source: The Object library appears at the bottom of the utility area on the right side of Xcode.
ja: オブジェクトライブラリは、Xcodeの右側ユーティリティ区画の１番下に見えます。

source: The asset catalog is a place to store and organize your image assets for an app.
ja: アセットカタログは、アプリのためのあなたの画像資産を保管して整理するところです。

source: The half-open range operator (..<) doesn’t include the upper number, so this range goes from 0 to 4 for a total of five loop iterations, drawing five buttons instead of just one.
ja: 半開範囲演算子（..<）は、高い方の数を含みません、それでこの範囲は0から4になり合計５回ループを繰り返して、５つのボタンを描画します、１つではなく。

source: The outline view, which appears on the left side of the canvas, lets you see a hierarchical representation of the objects in your storyboard.
ja: キャンバスの左側に現れるアウトラインビューは、あなたのストーリーボードの中のオブジェクトの階層表現をあなたに見させます。

source: The project navigator displays all the files in your project.
ja: プロジェクトナビゲータは、あなたのプロジェクト内のすべてのファイルを表示します。

source: The view controller whose contents are displayed at the beginning of a segue.
ja: このビューコントローラは、あるセグエの始まりでコンテンツが表示されるものです。

source: The view controller whose contents are displayed at the end of a segue.
ja: このビューコントローラは、セグエの終わりでコンテンツが表示されるものです。

source: The view hierarchy defines the layout of views relative to other views.
ja: ビュー階層は、ビューの配置を他のビューとの関係で定義します。

source: The Identity inspector lets you edit properties of an object in your storyboard related to that object’s identity, such as what class the object belongs to.
ja: 同一性インスペクタは、あなたにあなたのストーリーボードのあるオブジェクトのプロパティをそのオブジェクトの同一性に関して、例えばどのクラスにそのオブジェクトが所属するかなどを、編集させます。

source: The app delegate creates the window where your app’s content is drawn and provides a place to respond to state transitions within the app.
ja: アプリデリゲートは、あなたのアプリのコンテンツが描出されるウインドウを作成して、アプリ内部の状態推移に反応する場所を提供します。

source: The nil coalescing operator is used to return the value of an optional if the optional has a value, or return a default value otherwise.
ja: nil合体演算子は、オプショナルが値を持つならばオプショナルの値を、またはそうでなければ省略時の値を返します。

source: The storyboard entry point is set to the navigation controller because the navigation controller is now a container for the table view controller.
ja: ストーリーボードエントリポイントは、ナビゲーションコントローラに設定されます、なぜならナビゲーションコントローラは、現在テーブルビューコントローラのコンテナ（容れ物）だからです。

source: The Swift standard library includes a structure called Array that works well for tracking lists of items.
ja: Swift標準ライブラリは、ある構造体を含みます、それはArrayと呼ばれるものでいくつかの項目からなるリストの追跡に対して申し分なく働きます。

source: The Action Segue menu allows you to choose the type of segue used to transition from the meal list scene to the meal detail scene when the user taps the Add button.
ja: Action Segueメニューがあなたに選ばせるのは、ユーザが追加ボタンをタップする時に食事リストシーンから食事詳細シーンに画面転換するのに使うセグエの型です。

source: The Add New Constraints menu should look something like this:
ja: Add New Constraintsメニューは、このように見えるはずです：

source: The App Delegate Source File
ja: アプリデリゲート・ソースファイル

source: The Attributes inspector should now show the following keyboard settings:
ja: Attributesインスペクタは、今では次のようなキーボード設定を示すはずです：

source: The Functions menu lets you jump to a section in your code quickly.
ja: 「Functions menu」は、あなたにあなたのコードの中のあるセクションへとすばやくジャンプさせます。

source: The Group option defaults to your app name, FoodTracker.
ja: Groupオプションは、初期状態であなたのアプリ名、FoodTrackerです。

source: The NSCoder class defines a number of encode(_:forKey:) methods, each one taking a different type for the first argument.
ja: NSCoderクラスは、多くのencode(_:forKey:)メソッドを定義していて、それぞれのものが最初の引数として異なる型を取ります。

source: The Pin menu should look something like this:
ja: Pinメニューはこのようなものに見えるはずです：

source: The Scheme pop-up menu lets you choose which simulator or device you’d like to run your app on.
ja: Schemeポップアップメニューは、あなたがあなたのアプリを実行したいと思うのはどのデバイスまたはシミュレータかをあなたに選ばせます。

source: The Second property contains the control’s rating.
ja: ２番目のプロパティは、コントロールの持つ格付けを含みます。

source: The Single View Application template comes with a few source code files that set up the app environment.
ja: Single View Applicationひな形は、いくつかのソースコードファイルを備えています、それはアプリ環境を準備します。

source: The Single View Application template has another source code file: ViewController.swift.
ja: Single View Applicationひな形は、もう一つソースコードファイル：ViewController.swiftを持ちます。

source: The Swift compiler knows that init(frame:) must be marked as required, and offers a fix-it to make this change in your code.
ja: Swiftコンパイラは、init(frame:)がrequiredと印されなければならないことを知っています、そしてにあなたのコードでこの変更をするよう修正を提案します。

source: The Tap Gesture Recognizer object appears in the meal scene dock.
ja: Tap Gesture Recognizerオブジェクトが食事シーンドックに現れます。

source: The Test navigator also lists the individual test methods, grouped by test case.
ja: Testナビゲータはまた、個々のテストメソッドを、テスト項目によってグループ化してリストします。

source: The View Controller Source File
ja: ビューコントローラ・ソースファイル

source: The XCTest framework is Xcode’s testing framework.
ja: XCTestフレームワークは、Xcodeの持つテスト実行フレームワークです。

source: The Xcode app shows up as the first search result.
ja: Xcodeアプリが検索結果の最初に現れてきます。

source: The Xcode window, which you use to manage and navigate through the files and resources in your project.
ja: Xcodeウインドウ、あなたはそれを使って、あなたのプロジェクトのファイルやリソースを管理したりそれらの間を進んで行きます。

source: The ability of the Swift compiler to determine the type of a value from context, without an explicit type declaration.
ja: ある値の型を文脈から、明示的な型宣言なしに判断するSwiftコンパイラの能力、

source: The absence of a value or no value.
ja: あるべき値がないまたはどんな値もない。

source: The action is setDefaultLabelText(_).
ja: アクション（動作）は、setDefaultLabelText(_)です。

source: The anchor’s constraint(equalToConstant:) method returns a constraint that defines a constant height or width for the view.
ja: アンカーの持つconstraint(equalToConstant:)メソッドは、ビューのための定数で高さまたは幅を定義する制約を返します。

source: The app can terminate safely without losing any data.
ja: アプリは、何らデータを消失することなく安全に終了できます。

source: The app does not store any data when the meal detail scene is dismissed, and neither the prepare(for:sender:) method nor the unwind action method are called.
ja: アプリは食事シーンが退去させられる時に何らデータを保管しません、そしてprepare(for:sender:)メソッドも巻き戻しアクションメソッドも呼び出されません。

source: The app logs a debug message using the system’s standard logging mechanisms.
ja: アプリは、デバッグメッセージをシステムの持つ標準ログ機構を使って記録します。

source: The app navigates to the meal detail scene.
ja: アプリは、食事詳細シーンへと誘導します。

source: The app terminates with a SIGABRT signal.
ja: アプリは、SIGABRTシグナルで終了します。

source: The app then animates the transition from the meal list scene to the meal detail scene.
ja: アプリはそれから、食事リストシーンから食事詳細シーンへの推移をアニメーション表示します。

source: The application object is responsible for managing the life cycle of the app.
ja: アプリケーションオブジェクトは、アプリのライフサイクルを管理する責任を負います。

source: The appropriate method of presentation for this type of scene is a modal segue.
ja: この種のシーンを表現する適切な手法は、モーダルセグエです。

source: The appropriate place to load the stored data is in the table view’s viewDidLoad method.
ja: 格納されたデータをロードするのに適切な場所は、テーブルビューの持つviewDidLoadメソッドの中になります。

source: The app’s response to user action is then reflected back in the user interface.
ja: ユーザアクションへのアプリの応答は、それからユーザインターフェイスに返され反映されます。

source: The arrow that points to the left side of the scene on the canvas is the storyboard entry point, which means that this scene is loaded first when the app starts.
ja: キャンバス上でシーンの左側面を指し示す矢印はストーリーボードエントリポイントです、それは、アプリがスタートする時にこのシーンが最初にロードされることを意味します。

source: The attempt to downcast nil to [Meal] also fails, itself returning nil.
ja: nilを[Meal]へダウンキャストする試みもまた、それ自身nilを返して失敗します。

source: The background of a storyboard where you add and arrange user interface (UI) elements.
ja: ストーリーボードの背景、そこにあなたはユーザインターフェイス（UI）要素を加え整えます。

source: The background of the storyboard is the canvas.
ja: ストーリーボードの背景は、キャンバスです。

source: The behavior you just implemented is an example of the target-action pattern in iOS app design.
ja: あなたがたった今実装した挙動は、iOSアプリ設計におけるターゲットアクションパターンの１例です。

source: The blue layout guides help you place the text field.
ja: 青のレイアウトガイド（割り付け・配置目じるし）は、あなたがテキスト欄を設置するのを助けます。

source: The button changes to an Add button (+).
ja: ボタンが追加ボタン（+）に変わります。

source: The button doesn’t do anything yet.
ja: このボタンはまだ何もしません。

source: The button text changes to Cancel.
ja: ボタンテキストがCancelに変わります。

source: The button text changes to Save.
ja: ボタンテキストがSaveに変わります。

source: The buttons should be side-by-side.
ja: ボタンは横に並んでいるはずです。

source: The button’s heightAnchor and widthAnchor properties give access to layout anchors.
ja: ボタンの持つheightAnchorとwidthAnchorプロパティはレイアウトアンカーにアセクスさせます。

source: The cell is nested under Table View Controller Scene > Table View Controller > Table View.
ja: セルは、Table View Controller Scene > Table View Controller > Table Viewの下に入れ子にされます。

source: The class title changes to MealTableViewCell.
ja: クラスのタイトルをMealTableViewCellに変更してください。

source: The class title changes to MealTableViewController.
ja: クラスタイトルがMealTableViewControllerに変わります。

source: The code above examines the segue’s identifier.
ja: 上のコードは、セグエの持つ識別子を吟味します。

source: The code comments explain the setUp() and tearDown() methods, as well as the two sample test cases: testExample() and testPerformanceExample().
ja: コードコメントは、setUp()とtearDown()メソッド、それだけでなく２つのサンプルテスト項目：testExample() and testPerformanceExample()を説明します。

source: The code completion overlay shows up.
ja: コード補完重ね表示が現れてきます。

source: The code starts by importing both the XCTest framework and your app.
ja: このコードは、XCTestフレームワークとあなたのアプリの両方をインポートすることによって始まります。

source: The code to reset the value of the label is quite simple.
ja: ラベルの値をリセットするコードは、ごく簡単です。

source: The code within the else clause executes a method called popViewController(animated:), which pops the current view controller (the meal detail scene) off the navigation stack and animates the transition.
ja: else節内のコードは、popViewController(animated:)によって呼び出されるメソッドを実行します、それは現在のビューコントローラ（食事詳細シーン）をナビゲーションスタックからポップして遷移をアニメーション化します。

source: The console is a useful debugging mechanism that appears at the bottom of the editor area.
ja: コンソールは、有用なデバッグの仕組みです、それはエディタ区画の下に現れます。

source: The constraint’s isActive property activates or deactivates the constraint.
ja: 制約の持つisActiveプロパティは、制約を活性化または非活性化します。

source: The control also exposes properties that can be modified in the Attributes inspector.
ja: コントロールはまた、Attributesインスペクタで修正可能なプロパティを外界に触れさせます。

source: The control in the canvas should change to match the new settings.
ja: キャンバスの中のコントロールは、新しい設定に合うように変わるはずです。

source: The control should reset to a zero-star rating.
ja: コントロールは星ゼロの格付けにリセットされるはずです。

source: The controller displays and manages a table view.
ja: コントローラは、テーブルビューを表示および管理します。
